---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationServiceButton
source: html/84879b7f-df76-3b18-92c3-daa2ad7dda04.htm
---
# FabricationServiceButton Methods

Checks to see if the fabrication part type exists on one of the button conditions.